###################################################################

# Created by write_sdc on Sun Dec 24 12:17:49 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 10 [get_ports {out[63]}]
set_load -pin_load 10 [get_ports {out[62]}]
set_load -pin_load 10 [get_ports {out[61]}]
set_load -pin_load 10 [get_ports {out[60]}]
set_load -pin_load 10 [get_ports {out[59]}]
set_load -pin_load 10 [get_ports {out[58]}]
set_load -pin_load 10 [get_ports {out[57]}]
set_load -pin_load 10 [get_ports {out[56]}]
set_load -pin_load 10 [get_ports {out[55]}]
set_load -pin_load 10 [get_ports {out[54]}]
set_load -pin_load 10 [get_ports {out[53]}]
set_load -pin_load 10 [get_ports {out[52]}]
set_load -pin_load 10 [get_ports {out[51]}]
set_load -pin_load 10 [get_ports {out[50]}]
set_load -pin_load 10 [get_ports {out[49]}]
set_load -pin_load 10 [get_ports {out[48]}]
set_load -pin_load 10 [get_ports {out[47]}]
set_load -pin_load 10 [get_ports {out[46]}]
set_load -pin_load 10 [get_ports {out[45]}]
set_load -pin_load 10 [get_ports {out[44]}]
set_load -pin_load 10 [get_ports {out[43]}]
set_load -pin_load 10 [get_ports {out[42]}]
set_load -pin_load 10 [get_ports {out[41]}]
set_load -pin_load 10 [get_ports {out[40]}]
set_load -pin_load 10 [get_ports {out[39]}]
set_load -pin_load 10 [get_ports {out[38]}]
set_load -pin_load 10 [get_ports {out[37]}]
set_load -pin_load 10 [get_ports {out[36]}]
set_load -pin_load 10 [get_ports {out[35]}]
set_load -pin_load 10 [get_ports {out[34]}]
set_load -pin_load 10 [get_ports {out[33]}]
set_load -pin_load 10 [get_ports {out[32]}]
set_load -pin_load 10 [get_ports {out[31]}]
set_load -pin_load 10 [get_ports {out[30]}]
set_load -pin_load 10 [get_ports {out[29]}]
set_load -pin_load 10 [get_ports {out[28]}]
set_load -pin_load 10 [get_ports {out[27]}]
set_load -pin_load 10 [get_ports {out[26]}]
set_load -pin_load 10 [get_ports {out[25]}]
set_load -pin_load 10 [get_ports {out[24]}]
set_load -pin_load 10 [get_ports {out[23]}]
set_load -pin_load 10 [get_ports {out[22]}]
set_load -pin_load 10 [get_ports {out[21]}]
set_load -pin_load 10 [get_ports {out[20]}]
set_load -pin_load 10 [get_ports {out[19]}]
set_load -pin_load 10 [get_ports {out[18]}]
set_load -pin_load 10 [get_ports {out[17]}]
set_load -pin_load 10 [get_ports {out[16]}]
set_load -pin_load 10 [get_ports {out[15]}]
set_load -pin_load 10 [get_ports {out[14]}]
set_load -pin_load 10 [get_ports {out[13]}]
set_load -pin_load 10 [get_ports {out[12]}]
set_load -pin_load 10 [get_ports {out[11]}]
set_load -pin_load 10 [get_ports {out[10]}]
set_load -pin_load 10 [get_ports {out[9]}]
set_load -pin_load 10 [get_ports {out[8]}]
set_load -pin_load 10 [get_ports {out[7]}]
set_load -pin_load 10 [get_ports {out[6]}]
set_load -pin_load 10 [get_ports {out[5]}]
set_load -pin_load 10 [get_ports {out[4]}]
set_load -pin_load 10 [get_ports {out[3]}]
set_load -pin_load 10 [get_ports {out[2]}]
set_load -pin_load 10 [get_ports {out[1]}]
set_load -pin_load 10 [get_ports {out[0]}]
create_clock [get_ports clk]  -period 15  -waveform {0 10}
set_clock_uncertainty 0.1  [get_clocks clk]
set_false_path   -from [get_ports rst]
set_false_path -hold   -from [list [get_ports {in1[31]}] [get_ports {in1[30]}] [get_ports {in1[29]}] \
[get_ports {in1[28]}] [get_ports {in1[27]}] [get_ports {in1[26]}] [get_ports   \
{in1[25]}] [get_ports {in1[24]}] [get_ports {in1[23]}] [get_ports {in1[22]}]   \
[get_ports {in1[21]}] [get_ports {in1[20]}] [get_ports {in1[19]}] [get_ports   \
{in1[18]}] [get_ports {in1[17]}] [get_ports {in1[16]}] [get_ports {in1[15]}]   \
[get_ports {in1[14]}] [get_ports {in1[13]}] [get_ports {in1[12]}] [get_ports   \
{in1[11]}] [get_ports {in1[10]}] [get_ports {in1[9]}] [get_ports {in1[8]}]     \
[get_ports {in1[7]}] [get_ports {in1[6]}] [get_ports {in1[5]}] [get_ports      \
{in1[4]}] [get_ports {in1[3]}] [get_ports {in1[2]}] [get_ports {in1[1]}]       \
[get_ports {in1[0]}] [get_ports {in2[31]}] [get_ports {in2[30]}] [get_ports    \
{in2[29]}] [get_ports {in2[28]}] [get_ports {in2[27]}] [get_ports {in2[26]}]   \
[get_ports {in2[25]}] [get_ports {in2[24]}] [get_ports {in2[23]}] [get_ports   \
{in2[22]}] [get_ports {in2[21]}] [get_ports {in2[20]}] [get_ports {in2[19]}]   \
[get_ports {in2[18]}] [get_ports {in2[17]}] [get_ports {in2[16]}] [get_ports   \
{in2[15]}] [get_ports {in2[14]}] [get_ports {in2[13]}] [get_ports {in2[12]}]   \
[get_ports {in2[11]}] [get_ports {in2[10]}] [get_ports {in2[9]}] [get_ports    \
{in2[8]}] [get_ports {in2[7]}] [get_ports {in2[6]}] [get_ports {in2[5]}]       \
[get_ports {in2[4]}] [get_ports {in2[3]}] [get_ports {in2[2]}] [get_ports      \
{in2[1]}] [get_ports {in2[0]}]]
set_false_path -hold   -to [list [get_ports {out[63]}] [get_ports {out[62]}] [get_ports {out[61]}]   \
[get_ports {out[60]}] [get_ports {out[59]}] [get_ports {out[58]}] [get_ports   \
{out[57]}] [get_ports {out[56]}] [get_ports {out[55]}] [get_ports {out[54]}]   \
[get_ports {out[53]}] [get_ports {out[52]}] [get_ports {out[51]}] [get_ports   \
{out[50]}] [get_ports {out[49]}] [get_ports {out[48]}] [get_ports {out[47]}]   \
[get_ports {out[46]}] [get_ports {out[45]}] [get_ports {out[44]}] [get_ports   \
{out[43]}] [get_ports {out[42]}] [get_ports {out[41]}] [get_ports {out[40]}]   \
[get_ports {out[39]}] [get_ports {out[38]}] [get_ports {out[37]}] [get_ports   \
{out[36]}] [get_ports {out[35]}] [get_ports {out[34]}] [get_ports {out[33]}]   \
[get_ports {out[32]}] [get_ports {out[31]}] [get_ports {out[30]}] [get_ports   \
{out[29]}] [get_ports {out[28]}] [get_ports {out[27]}] [get_ports {out[26]}]   \
[get_ports {out[25]}] [get_ports {out[24]}] [get_ports {out[23]}] [get_ports   \
{out[22]}] [get_ports {out[21]}] [get_ports {out[20]}] [get_ports {out[19]}]   \
[get_ports {out[18]}] [get_ports {out[17]}] [get_ports {out[16]}] [get_ports   \
{out[15]}] [get_ports {out[14]}] [get_ports {out[13]}] [get_ports {out[12]}]   \
[get_ports {out[11]}] [get_ports {out[10]}] [get_ports {out[9]}] [get_ports    \
{out[8]}] [get_ports {out[7]}] [get_ports {out[6]}] [get_ports {out[5]}]       \
[get_ports {out[4]}] [get_ports {out[3]}] [get_ports {out[2]}] [get_ports      \
{out[1]}] [get_ports {out[0]}]]
set_input_delay -clock clk  -max 0.2  [get_ports rst]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[31]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[30]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[29]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[28]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[27]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[26]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[25]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[24]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[23]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[22]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[21]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[20]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[19]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[18]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[17]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[16]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[15]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[14]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[13]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[12]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[11]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[10]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[9]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[8]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[7]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[6]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[5]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[4]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[3]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[2]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[1]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in1[0]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[31]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[30]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[29]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[28]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[27]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[26]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[25]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[24]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[23]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[22]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[21]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[20]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[19]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[18]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[17]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[16]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[15]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[14]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[13]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[12]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[11]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[10]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[9]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[8]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[7]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[6]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[5]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[4]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[3]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[2]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[1]}]
set_input_delay -clock clk  -max 0.2  [get_ports {in2[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[63]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[62]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[61]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[60]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[59]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[58]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[57]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[56]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[55]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[54]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[53]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[52]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[51]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[50]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[49]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[48]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[47]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[46]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[45]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[44]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[43]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[42]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[41]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[40]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[39]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[38]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[37]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[36]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[35]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[34]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[33]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[32]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[31]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[30]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[29]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[28]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[27]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[26]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[25]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[24]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[23]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[22]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[21]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[20]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[19]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[18]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[17]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[16]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {out[0]}]
